###############################################################################
# Created by write_sdc
# Sun Nov  3 22:07:24 2024
###############################################################################
current_design SLRV
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 100.0000 [get_ports {wb_clk_i}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_clock_latency -source -min 4.6500 [get_clocks {clk}]
set_clock_latency -source -max 5.5700 [get_clocks {clk}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {insMemEn}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {insMemEn}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_data_in[0]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_data_in[0]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {la_data_in[1]}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {la_data_in[1]}]
set_input_delay 0.1800 -clock [get_clocks {clk}] -min -add_delay [get_ports {reset}]
set_input_delay 1.8700 -clock [get_clocks {clk}] -max -add_delay [get_ports {reset}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[16]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[16]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[17]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[17]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[18]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[18]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[19]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[19]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[20]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[20]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[21]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[21]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[22]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[22]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[23]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[23]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[24]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[24]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[25]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[25]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[26]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[26]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[27]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[27]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[28]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[28]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[29]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[29]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[30]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[30]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[31]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[31]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {a7[9]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {a7[9]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[0]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[10]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[11]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[12]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[13]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[14]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[15]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[16]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[16]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[17]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[17]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[18]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[18]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[19]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[19]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[1]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[20]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[20]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[21]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[21]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[22]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[22]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[23]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[23]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[24]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[24]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[25]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[25]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[26]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[26]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[27]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[27]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[28]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[28]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[29]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[29]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[2]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[30]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[30]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[31]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[31]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[3]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[4]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[5]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[6]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[7]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[8]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -rise -max -add_delay [get_ports {gp[9]}]
set_output_delay 1.0000 -clock [get_clocks {clk}] -fall -max -add_delay [get_ports {gp[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.1900 [get_ports {csb}]
set_load -pin_load 0.1900 [get_ports {pc_led}]
set_load -pin_load 0.1900 [get_ports {pc_led_oeb}]
set_load -pin_load 0.1900 [get_ports {a7[31]}]
set_load -pin_load 0.1900 [get_ports {a7[30]}]
set_load -pin_load 0.1900 [get_ports {a7[29]}]
set_load -pin_load 0.1900 [get_ports {a7[28]}]
set_load -pin_load 0.1900 [get_ports {a7[27]}]
set_load -pin_load 0.1900 [get_ports {a7[26]}]
set_load -pin_load 0.1900 [get_ports {a7[25]}]
set_load -pin_load 0.1900 [get_ports {a7[24]}]
set_load -pin_load 0.1900 [get_ports {a7[23]}]
set_load -pin_load 0.1900 [get_ports {a7[22]}]
set_load -pin_load 0.1900 [get_ports {a7[21]}]
set_load -pin_load 0.1900 [get_ports {a7[20]}]
set_load -pin_load 0.1900 [get_ports {a7[19]}]
set_load -pin_load 0.1900 [get_ports {a7[18]}]
set_load -pin_load 0.1900 [get_ports {a7[17]}]
set_load -pin_load 0.1900 [get_ports {a7[16]}]
set_load -pin_load 0.1900 [get_ports {a7[15]}]
set_load -pin_load 0.1900 [get_ports {a7[14]}]
set_load -pin_load 0.1900 [get_ports {a7[13]}]
set_load -pin_load 0.1900 [get_ports {a7[12]}]
set_load -pin_load 0.1900 [get_ports {a7[11]}]
set_load -pin_load 0.1900 [get_ports {a7[10]}]
set_load -pin_load 0.1900 [get_ports {a7[9]}]
set_load -pin_load 0.1900 [get_ports {a7[8]}]
set_load -pin_load 0.1900 [get_ports {a7[7]}]
set_load -pin_load 0.1900 [get_ports {a7[6]}]
set_load -pin_load 0.1900 [get_ports {a7[5]}]
set_load -pin_load 0.1900 [get_ports {a7[4]}]
set_load -pin_load 0.1900 [get_ports {a7[3]}]
set_load -pin_load 0.1900 [get_ports {a7[2]}]
set_load -pin_load 0.1900 [get_ports {a7[1]}]
set_load -pin_load 0.1900 [get_ports {a7[0]}]
set_load -pin_load 0.1900 [get_ports {gp[31]}]
set_load -pin_load 0.1900 [get_ports {gp[30]}]
set_load -pin_load 0.1900 [get_ports {gp[29]}]
set_load -pin_load 0.1900 [get_ports {gp[28]}]
set_load -pin_load 0.1900 [get_ports {gp[27]}]
set_load -pin_load 0.1900 [get_ports {gp[26]}]
set_load -pin_load 0.1900 [get_ports {gp[25]}]
set_load -pin_load 0.1900 [get_ports {gp[24]}]
set_load -pin_load 0.1900 [get_ports {gp[23]}]
set_load -pin_load 0.1900 [get_ports {gp[22]}]
set_load -pin_load 0.1900 [get_ports {gp[21]}]
set_load -pin_load 0.1900 [get_ports {gp[20]}]
set_load -pin_load 0.1900 [get_ports {gp[19]}]
set_load -pin_load 0.1900 [get_ports {gp[18]}]
set_load -pin_load 0.1900 [get_ports {gp[17]}]
set_load -pin_load 0.1900 [get_ports {gp[16]}]
set_load -pin_load 0.1900 [get_ports {gp[15]}]
set_load -pin_load 0.1900 [get_ports {gp[14]}]
set_load -pin_load 0.1900 [get_ports {gp[13]}]
set_load -pin_load 0.1900 [get_ports {gp[12]}]
set_load -pin_load 0.1900 [get_ports {gp[11]}]
set_load -pin_load 0.1900 [get_ports {gp[10]}]
set_load -pin_load 0.1900 [get_ports {gp[9]}]
set_load -pin_load 0.1900 [get_ports {gp[8]}]
set_load -pin_load 0.1900 [get_ports {gp[7]}]
set_load -pin_load 0.1900 [get_ports {gp[6]}]
set_load -pin_load 0.1900 [get_ports {gp[5]}]
set_load -pin_load 0.1900 [get_ports {gp[4]}]
set_load -pin_load 0.1900 [get_ports {gp[3]}]
set_load -pin_load 0.1900 [get_ports {gp[2]}]
set_load -pin_load 0.1900 [get_ports {gp[1]}]
set_load -pin_load 0.1900 [get_ports {gp[0]}]
set_load -pin_load 0.1900 [get_ports {insMemAddr[8]}]
set_load -pin_load 0.1900 [get_ports {insMemAddr[7]}]
set_load -pin_load 0.1900 [get_ports {insMemAddr[6]}]
set_load -pin_load 0.1900 [get_ports {insMemAddr[5]}]
set_load -pin_load 0.1900 [get_ports {insMemAddr[4]}]
set_load -pin_load 0.1900 [get_ports {insMemAddr[3]}]
set_load -pin_load 0.1900 [get_ports {insMemAddr[2]}]
set_load -pin_load 0.1900 [get_ports {insMemAddr[1]}]
set_load -pin_load 0.1900 [get_ports {insMemAddr[0]}]
set_load -pin_load 0.1900 [get_ports {wmask[3]}]
set_load -pin_load 0.1900 [get_ports {wmask[2]}]
set_load -pin_load 0.1900 [get_ports {wmask[1]}]
set_load -pin_load 0.1900 [get_ports {wmask[0]}]
set_input_transition -min 0.0700 [get_ports {insMemEn}]
set_input_transition -max 0.8600 [get_ports {insMemEn}]
set_input_transition -min 0.0700 [get_ports {reset}]
set_input_transition -max 0.8600 [get_ports {reset}]
set_input_transition 0.6100 [get_ports {wb_clk_i}]
set_input_transition -min 0.0700 [get_ports {la_data_in[1]}]
set_input_transition -max 0.8600 [get_ports {la_data_in[1]}]
set_input_transition -min 0.0700 [get_ports {la_data_in[0]}]
set_input_transition -max 0.8600 [get_ports {la_data_in[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 1.0000 [current_design]
set_max_fanout 16.0000 [current_design]
